
## Windows Defender Event Log from Windows Event Log


## --------------------------------------------------------------------------------------------
## General - Windows Defender
## First we rename the long source definition which comes by default
[source::...WinEventLog:Microsoft-Windows-Windows Defender/Operational]
# Default shorten to easy readable source
EVAL-source = "XmlWinEventLog:Defender"


## --------------------------------------------------------------------------------------------
## Built-In - what's already there anyway
## Some fields are not extracted correctly with the previous windows-app.


## --------------------------------------------------------------------------------------------
## CIM
## --------------------------------------------------------------------------------------------
## CIM - Malware: describe malware detection and endpoint protection management
## CIM - Alerts (IDS): attack detection events gathered by network monitoring devices and apps.
## --------------------------------------------------------------------------------------------

# [X] ALERT     action - The action taken by the IDS (allowed, blocked)
# [X] MALWARE   action - The action taken by the reporting device (allowed, blocked, deferred)
LOOKUP-0Action_ID = windefender_action_lookup id AS Action_ID OUTPUTNEW action AS action
LOOKUP-CategoryString_for_windows = windefender_signature_lookup signature_id OUTPUTNEW action, CategoryString, result, signature, subsystem

# [X] ALERT     category - The vendor-provided category of the triggered signature, such as spyware.
# [X] MALWARE   category - The category of the malware event, such as keylogger or ad-supported program
EVAL-category = "Security"
EVAL-threat_category = Category_Name

# [X] MALWARE   date - The date of the malware event
EVAL-date = case(isnotnull(Detection_Time), strptime(Detection_Time,"%Y-%m-%dT%H:%M:%S.%f"), 1==1, strptime(SystemTime,"'%Y-%m-%dT%H:%M:%S.%9NZ'"))

# [X] ALERT     dest - The destination of the attack detected by the IDS (dest_host, dest_ip, dest_name)
# [X] MALWARE   dest - The system that was affected by the malware event (dest_host, dest_ip, or dest_name)
FIELDALIAS-0dest = Computer as dest

# [X] MALWARE   dest_host - The destination host, if applicable
# [X] MALWARE   dest_nt_domain - The NT domain of the destination, if applicable
REPORT-dest = windefender_dest

# [X] ALERT     dest_url - The destination url, which was accessed when the ALERT was triggered
FIELDALIAS-0dest_url = Destination as dest_url

# [X] ALERT     dvc - The device that detected the intrusion event (dvc_host, dvc_ip, dvc_name)
# [X] ALERT     dvc_host - The dvc_host that detected the intrusion event
EVAL-dvc_host = dvc_nt_host

# [X] ALERT     file_hash - A cryptographic identifier assigned to the file object affected by the event.
# [X] MALWARE   file_hash - The hash of the file with suspected malware
REPORT-file_hash = windefender_hashes
EVAL-file_hash = if(isnull(file_hash), Sha256, file_hash)

# [X] ALERT     file_name - The name of the file, such as notepad.exe.
# [X] ALERT     file_path - The path of the file, such as C:\\Windows\\System32\\notepad.exe.
# [X] MALWARE   file_name - The name of the file with suspected malware
# [X] MALWARE   file_path - The full file path of the file with suspected malware

# [ ] ALERT     src - The source involved in the attack detected by the IDS. (src_host, src_ip, or src_name)
# [ ] MALWARE   src - The source of the event, such as a DAT file relay server (src_host, src_ip, or src_name)
# [X] MALWARE   src_url - The source_url of the malware

REPORT-path = windefender_src_url, windefender_file_path, windefender_file_name

# FILEPATH Fixes
SEDCMD-gthen_in_filepath = s/-\&gt\;/##/g
SEDCMD-0replace_nsis = s/-\&gt\;\(nsis-6-\)//g
# Alternative to SED-Command is to use evaluated fields, care for transformation windefender_file_path and windefender_webfile &[a-z]+; regex
# EVAL-file_name = replace(replace(file_name, "/-\&gt\;\(nsis-6-\)", ""), "-\&gt\;", "##")
# REPLACE HTML decoded characters for extracted field file_path and file_name
EVAL-file_path =if(isnull(file_path) AND isnull(registry_key_name), Path, file_path)

# [~] ALERT     ids_type - The type of IDS that generated the event. (network, host, application, wireless)
EVAL-ids_type="host"

# [ ] MALWARE   sender - The reported sender of an email-based attack

# [X] ALERT     severity - The severity of the network protection event. (critical, high, medium, low, informational)
LOOKUP-severity = windefender_severity_lookup Severity AS Severity_Name OUTPUT severity_id,severity

# [X] ALERT     signature - The name of the intrusion detected on the client (PlugAndPlay_BO and JavaScript_Obfuscation_Fre)
# [X] MALWARE   signature - The name of the malware infection detected on the client (Trojan.Vundo, Spyware.Gaobot, W32.Nimbda)
EVAL-signature = Threat_Name
EVAL-signature_version = Current_Signature_Version

# [ ] ALERT     transport - The OSI layer 4 (transport) protocol of the intrusion, in lower case.

# [X] ALERT     user - The user involved with the intrusion detection event.
# [X] MALWARE   user - The user involved in the malware event
FIELDALIAS-0user = Detection_User AS user

# [X] ALERT     user_name - The user name involved with the intrusion detection event.
REPORT-userdetails = windefender_userdetails

# [X] ALERT     user_domain - The domain of the user involved with the intrusion detection event.
EVAL-user_domain = case(user_nt_domain=="NT AUTHORITY" OR user_nt_domain=="NT-AUTORITÄT", "SYSTEM",1==1, user_nt_domain)

# [X] MALWARE   url - A URL containing more information about the vulnerability
EVAL-url = FWLink

# [X] ALERT     vendor_product - The vendor and product name of the IDS or IPS system that detected the vulnerability
# [X] MALWARE   vendor_product - The vendor and product name of the endpoint protection system, such as Symantec AntiVirus.
EVAL-vendor_product = "Microsoft Defender AntiVirus"
EVAL-product = "Defender"
EVAL-vendor = "Microsoft"






## --------------------------------------------------------------------------------------------
## ADDITIONAL FIELDS
## --------------------------------------------------------------------------------------------

# Rule for Correlation
EVAL-rule_id = if(isnotnull(Threat_ID),Threat_ID,if(isnotnull(ID),ID,event_id))

# Error Information
FIELDALIAS-Error_Code = Error_Code AS error_code
FIELDALIAS-Error_Description = Error_Description AS error_description
LOOKUP-Error = windefender_errorcode_lookup error_code OUTPUT error_message,error_reason,error_resolution

# Scanning Info
LOOKUP-Scan_Parameters = windefender_code_lookup id AS Scan_Parameters OUTPUT property AS Scan_Parameters
LOOKUP-Scan_Type = windefender_code_lookup id AS Scan_Type OUTPUT property AS Scan_Type

# Detection Info
LOOKUP-Source_Name = windefender_code_lookup id AS Source_Name OUTPUT property AS Source_Name
LOOKUP-Type_Name = windefender_code_lookup id AS Type_Name OUTPUT property AS Type_Name

# Process Information
FIELDALIAS-process_path = Process_Name as process_path
REPORT-process_name_attack = windefender_process_name
EVAL-process_name = process_name_attack
REPORT-process_details =  windefender_process_id, windefender_process_start, windefender_process_commandline

## Registry_Key
REPORT-registry_key_name = windefender_registry_key_name

# General Code to Human Readable Translation
LOOKUP-Action_Name = windefender_code_lookup id AS Action_Name OUTPUT property AS Action_Name
LOOKUP-BM_State = windefender_code_lookup id AS Action_Name OUTPUT property AS Action_Name
LOOKUP-Dynamic_Signature_Type = windefender_code_lookup id AS  Dynamic_Signature_Type OUTPUT property AS Dynamic_Signature_Type
LOOKUP-Dynamic_security_intelligence_Type = windefender_code_lookup id AS Dynamic_security_intelligence_Type id OUTPUT property AS Dynamic_security_intelligence_Type
LOOKUP-Execution_Name = windefender_code_lookup id AS Execution_Name OUTPUT property AS Execution_Name
LOOKUP-Feature_Name = windefender_code_lookup id AS Feature_Name OUTPUT property AS Feature_Name
LOOKUP-IOAV_state = windefender_code_lookup id AS IOAV_state OUTPUT property AS IOAV_state
LOOKUP-OA_state = windefender_code_lookup id AS OA_state OUTPUT property AS OA_state
LOOKUP-Origin_Name = windefender_code_lookup id AS Origin_Name OUTPUT property AS Origin_Name
LOOKUP-Persistence_Limit_Type = windefender_code_lookup id AS Persistence_Limit_Type OUTPUT property AS Persistence_Limit_Type
LOOKUP-Product_Name = windefender_code_lookup id AS Product_Name OUTPUT property AS Product_Name
LOOKUP-RTP_state = windefender_code_lookup id AS RTP_state OUTPUT property AS RTP_state
LOOKUP-Removal_Reason_Value = windefender_code_lookup id AS Removal_Reason_Value OUTPUT property AS Removal_Reason_Value
LOOKUP-Security_Intelligence_Type = windefender_code_lookup id AS Security_intelligence_Type id OUTPUT property AS Security_intelligence_Type
LOOKUP-Signature_Type = windefender_code_lookup id AS Signature_Type OUTPUT property AS Signature_Type
LOOKUP-Update_Source = windefender_code_lookup id AS Update_Source OUTPUT property AS Update_Source
LOOKUP-Update_Type = windefender_code_lookup id AS Update_Type OUTPUT property AS Update_Type
LOOKUP-Updated_State = windefender_code_lookup id AS Update_State OUTPUT property AS Update_State
